## Plan Result (dev-frontdoor)




<pre><code>Plan: 2 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;darts-portal&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;portal-dev&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;jd-bureau&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"
        name                                 = "sdshmcts-dev"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-casetracker" -> "healthProbeSettings-portal-dev"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-casetracker"
          ~ load_balancing_name = "loadBalancingSettings-dev-casetracker" -> "loadBalancingSettings-portal-dev"
          ~ name                = "dev-casetracker" -> "portal-dev"

          ~ backend {
              ~ address     = "civil-loadb-y5o7jqurq76d-2065714619.eu-west-2.elb.amazonaws.com" -> "pre-dev.powerappsportals.com"
              ~ host_header = "dev.casetracker.justice.gov.uk" -> "portal-dev.pre-recorded-evidence.justice.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-certificatedbailiffs" -> "healthProbeSettings-dev-casetracker"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-certificatedbailiffs"
          ~ load_balancing_name = "loadBalancingSettings-dev-certificatedbailiffs" -> "loadBalancingSettings-dev-casetracker"
          ~ name                = "dev-certificatedbailiffs" -> "dev-casetracker"

          ~ backend {
              ~ address     = "certi-loadb-a49bsydpgeb7-1204811385.eu-west-2.elb.amazonaws.com" -> "civil-loadb-y5o7jqurq76d-2065714619.eu-west-2.elb.amazonaws.com"
              ~ host_header = "dev.certificatedbailiffs.justice.gov.uk" -> "dev.casetracker.justice.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-courtfines" -> "healthProbeSettings-dev-certificatedbailiffs"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-courtfines"
          ~ load_balancing_name = "loadBalancingSettings-dev-courtfines" -> "loadBalancingSettings-dev-certificatedbailiffs"
          ~ name                = "dev-courtfines" -> "dev-certificatedbailiffs"

          ~ backend {
              ~ address     = "court-loadb-118vi6sleq8ii-1970392396.eu-west-2.elb.amazonaws.com" -> "certi-loadb-a49bsydpgeb7-1204811385.eu-west-2.elb.amazonaws.com"
              ~ host_header = "dev.courtfines.direct.gov.uk" -> "dev.certificatedbailiffs.justice.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-immigrationappealsonline" -> "healthProbeSettings-dev-courtfines"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-immigrationappealsonline"
          ~ load_balancing_name = "loadBalancingSettings-dev-immigrationappealsonline" -> "loadBalancingSettings-dev-courtfines"
          ~ name                = "dev-immigrationappealsonline" -> "dev-courtfines"

          ~ backend {
              ~ address     = "iacfe-loadb-p3eli3f0pz30-1245399594.eu-west-2.elb.amazonaws.com" -> "court-loadb-118vi6sleq8ii-1970392396.eu-west-2.elb.amazonaws.com"
              ~ host_header = "dev.immigrationappealsonline.justice.gov.uk" -> "dev.courtfines.direct.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-dev-immigrationappealsonline"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/sds-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-sds-api-mgmt" -> "loadBalancingSettings-dev-immigrationappealsonline"
          ~ name                = "sds-api-mgmt" -> "dev-immigrationappealsonline"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-sdsapimgmtdev.uksouth.cloudapp.azure.com" -> "iacfe-loadb-p3eli3f0pz30-1245399594.eu-west-2.elb.amazonaws.com"
              ~ host_header = "sds-api-mgmt.dev.platform.hmcts.net" -> "dev.immigrationappealsonline.justice.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-land-reg-division" -> "healthProbeSettings-sds-api-mgmt"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-land-reg-division"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-land-reg-division" -> "loadBalancingSettings-sds-api-mgmt"
          ~ name                = "dev-trib-land-reg-division" -> "sds-api-mgmt"

          ~ backend {
              ~ address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com" -> "firewall-nonprodi-palo-sdsapimgmtdev.uksouth.cloudapp.azure.com"
              ~ host_header = "dev.landregistrationdivision.dsd.io" -> "sds-api-mgmt.dev.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-immigration-svcs" -> "healthProbeSettings-dev-trib-land-reg-division"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-immigration-svcs"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-immigration-svcs" -> "loadBalancingSettings-dev-trib-land-reg-division"
          ~ name                = "dev-trib-immigration-svcs" -> "dev-trib-land-reg-division"

          ~ backend {
              ~ host_header = "dev.immigrationservices.dsd.io" -> "dev.landregistrationdivision.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-info-rights" -> "healthProbeSettings-dev-trib-immigration-svcs"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-info-rights"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-info-rights" -> "loadBalancingSettings-dev-trib-immigration-svcs"
          ~ name                = "dev-trib-info-rights" -> "dev-trib-immigration-svcs"

          ~ backend {
              ~ host_header = "dev.informationrights.dsd.io" -> "dev.immigrationservices.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-admin-appeals" -> "healthProbeSettings-dev-trib-info-rights"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-admin-appeals"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-admin-appeals" -> "loadBalancingSettings-dev-trib-info-rights"
          ~ name                = "dev-trib-admin-appeals" -> "dev-trib-info-rights"

          ~ backend {
              ~ host_header = "dev.administrativeappeals.dsd.io" -> "dev.informationrights.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-care-standards" -> "healthProbeSettings-dev-trib-admin-appeals"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-care-standards"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-care-standards" -> "loadBalancingSettings-dev-trib-admin-appeals"
          ~ name                = "dev-trib-care-standards" -> "dev-trib-admin-appeals"

          ~ backend {
              ~ host_header = "dev.carestandards.dsd.io" -> "dev.administrativeappeals.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-lands-chamber" -> "healthProbeSettings-dev-trib-care-standards"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-lands-chamber"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-lands-chamber" -> "loadBalancingSettings-dev-trib-care-standards"
          ~ name                = "dev-trib-lands-chamber" -> "dev-trib-care-standards"

          ~ backend {
              ~ host_header = "dev.landschamber.dsd.io" -> "dev.carestandards.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-finance-tax" -> "healthProbeSettings-dev-trib-lands-chamber"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-finance-tax"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-finance-tax" -> "loadBalancingSettings-dev-trib-lands-chamber"
          ~ name                = "dev-trib-finance-tax" -> "dev-trib-lands-chamber"

          ~ backend {
              ~ host_header = "dev.financeandtax.dsd.io" -> "dev.landschamber.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-employment-appeals" -> "healthProbeSettings-dev-trib-finance-tax"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-employment-appeals"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-employment-appeals" -> "loadBalancingSettings-dev-trib-finance-tax"
          ~ name                = "dev-trib-employment-appeals" -> "dev-trib-finance-tax"

          ~ backend {
              ~ host_header = "dev.employmentappeals.dsd.io" -> "dev.financeandtax.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-tansport-appeals" -> "healthProbeSettings-dev-trib-employment-appeals"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-tansport-appeals"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-tansport-appeals" -> "loadBalancingSettings-dev-trib-employment-appeals"
          ~ name                = "dev-trib-tansport-appeals" -> "dev-trib-employment-appeals"

          ~ backend {
              ~ host_header = "dev.transportappeals.dsd.io" -> "dev.employmentappeals.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-cicap" -> "healthProbeSettings-dev-trib-tansport-appeals"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-cicap"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-cicap" -> "loadBalancingSettings-dev-trib-tansport-appeals"
          ~ name                = "dev-trib-cicap" -> "dev-trib-tansport-appeals"

          ~ backend {
              ~ host_header = "dev.cicap.dsd.io" -> "dev.transportappeals.dsd.io"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-1681719522616" -> "healthProbeSettings-dev-trib-cicap"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/portal-dev"
          ~ load_balancing_name = "loadBalancingSettings-1681719522616" -> "loadBalancingSettings-dev-trib-cicap"
          ~ name                = "portal-dev" -> "dev-trib-cicap"

          ~ backend {
              ~ address     = "pre-dev.powerappsportals.com" -> "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              ~ host_header = "pre-dev.powerappsportals.com" -> "dev.cicap.dsd.io"
                # (5 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-casetracker"
          ~ name                = "healthProbeSettings-dev-casetracker" -> "healthProbeSettings-portal-dev"
          ~ path                = "/health/liveness" -> "/SignIn?ReturnUrl=%2F"
          ~ protocol            = "Http" -> "Https"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-certificatedbailiffs"
          ~ name                = "healthProbeSettings-dev-certificatedbailiffs" -> "healthProbeSettings-dev-casetracker"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-courtfines"
          ~ name                = "healthProbeSettings-dev-courtfines" -> "healthProbeSettings-dev-certificatedbailiffs"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-immigrationappealsonline"
          ~ name                = "healthProbeSettings-dev-immigrationappealsonline" -> "healthProbeSettings-dev-courtfines"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-sds-api-mgmt"
          ~ name                = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-dev-immigrationappealsonline"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-land-reg-division"
          ~ name                = "healthProbeSettings-dev-trib-land-reg-division" -> "healthProbeSettings-sds-api-mgmt"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-immigration-svcs"
          ~ name                = "healthProbeSettings-dev-trib-immigration-svcs" -> "healthProbeSettings-dev-trib-land-reg-division"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-info-rights"
          ~ name                = "healthProbeSettings-dev-trib-info-rights" -> "healthProbeSettings-dev-trib-immigration-svcs"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-admin-appeals"
          ~ name                = "healthProbeSettings-dev-trib-admin-appeals" -> "healthProbeSettings-dev-trib-info-rights"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-care-standards"
          ~ name                = "healthProbeSettings-dev-trib-care-standards" -> "healthProbeSettings-dev-trib-admin-appeals"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-lands-chamber"
          ~ name                = "healthProbeSettin

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ps/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-care-standards"
          ~ name               = "dev-trib-care-standards" -> "dev-trib-admin-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-care-standards" -> "dev-trib-admin-appeals"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-trib-lands-chamber",
              + "dev-trib-care-standards",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-lands-chamber"
          ~ name               = "dev-trib-lands-chamber" -> "dev-trib-care-standards"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-lands-chamber" -> "dev-trib-care-standards"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-trib-finance-tax",
              + "dev-trib-lands-chamber",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-finance-tax"
          ~ name               = "dev-trib-finance-tax" -> "dev-trib-lands-chamber"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-finance-tax" -> "dev-trib-lands-chamber"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-trib-employment-appeals",
              + "dev-trib-finance-tax",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-employment-appeals"
          ~ name               = "dev-trib-employment-appeals" -> "dev-trib-finance-tax"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-employment-appeals" -> "dev-trib-finance-tax"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-trib-tansport-appeals",
              + "dev-trib-employment-appeals",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-tansport-appeals"
          ~ name               = "dev-trib-tansport-appeals" -> "dev-trib-employment-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-tansport-appeals" -> "dev-trib-employment-appeals"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-trib-cicap",
              + "dev-trib-tansport-appeals",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-cicap"
          ~ name               = "dev-trib-cicap" -> "dev-trib-tansport-appeals"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-cicap" -> "dev-trib-tansport-appeals"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "toffee",
              + "dev-trib-cicap",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "dev-trib-cicap"
            # (3 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "dev-trib-cicap"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "jd-bureau",
              + "darts-portal",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/jd-bureauHttpsRedirect"
          ~ name               = "jd-bureauHttpsRedirect" -> "darts-portal"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "darts-portal"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jd-public",
              + "toffee",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/jd-publicHttpsRedirect"
          ~ name               = "jd-publicHttpsRedirect" -> "toffeeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-test-web",
              + "jd-bureau",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-test-webHttpsRedirect"
          ~ name               = "vh-test-webHttpsRedirect" -> "jd-bureauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web",
              + "jd-public",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-webHttpsRedirect"
          ~ name               = "vh-video-webHttpsRedirect" -> "jd-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-reform",
              + "vh-test-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-reformHttpsRedirect"
          ~ name               = "vh-video-web-reformHttpsRedirect" -> "vh-test-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-pr-1955",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-pr-1955HttpsRedirect"
          ~ name               = "vh-video-web-pr-1955HttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-admin-web",
              + "vh-video-web-reform",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-admin-webHttpsRedirect"
          ~ name               = "vh-admin-webHttpsRedirect" -> "vh-video-web-reformHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-casetracker",
              + "vh-video-web-pr-1955",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-casetrackerHttpsRedirect"
          ~ name               = "dev-casetrackerHttpsRedirect" -> "vh-video-web-pr-1955HttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-certificatedbailiffs",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-certificatedbailiffsHttpsRedirect"
          ~ name               = "dev-certificatedbailiffsHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-courtfines",
              + "portal-dev",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-courtfinesHttpsRedirect"
          ~ name               = "dev-courtfinesHttpsRedirect" -> "portal-devHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-immigrationappealsonline",
              + "dev-casetracker",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-immigrationappealsonlineHttpsRedirect"
          ~ name               = "dev-immigrationappealsonlineHttpsRedirect" -> "dev-casetrackerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "dev-certificatedbailiffs",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "dev-certificatedbailiffsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "portal-dev-pre-recorded-evidence-justice-gov-uk",
              + "dev-courtfines",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/portal-dev"
          ~ name               = "portal-dev" -> "dev-courtfinesHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "defaultBackend" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_query_parameters                = [] -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpsOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal-dev-pre-recorded-evidence-justice-gov-uk",
              + "dev-immigrationappealsonline",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/portal-devHttpsRedirect"
          ~ name               = "portal-devHttpsRedirect" -> "dev-immigrationappealsonlineHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + name               = "sds-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (47 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["darts-portal"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/darts-portal"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["portal-dev"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/portal-dev"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-bureau"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdbureaudev"
        name                              = "jdbureaudev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "IPMatchWhitelist"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              ~ match_values       = [
                    # (2 unchanged elements hidden)
                    "194.33.192.0/25",
                  + "51.149.249.0/27",
                    "194.33.196.0/25",
                  + "51.149.249.32/27",
                    "195.59.75.0/24",
                    # (7 unchanged elements hidden)
                    "51.149.249.32/27",
                  + "51.149.250.0/24",
                  + "51.149.249.0/29",
                  + "194.33.249.0/29",
                  + "51.149.249.32/29",
                  + "194.33.248.0/29",
                  + "20.49.214.199/32",
                  + "20.49.214.228/32",
                ]
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-bureau"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdbureaudev"
        name                              = "jdbureaudev"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (6 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "IPMatchWhitelist"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              ~ match_values       = [
                    # (2 unchanged elements hidden)
                    "194.33.192.0/25",
                  - "51.149.249.0/27",
                    "194.33.196.0/25",
                  - "51.149.249.32/27",
                    "195.59.75.0/24",
                    # (7 unchanged elements hidden)
                    "51.149.249.32/27",
                  - "51.149.250.0/24",
                  - "51.149.249.0/29",
                  - "194.33.249.0/29",
                  - "51.149.249.32/29",
                  - "194.33.248.0/29",
                  - "20.49.214.199/32",
                  - "20.49.214.228/32",
                ]
                # (4 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":411,"Program":"tfcmt","SHA1":"","Target":"dev-frontdoor","Vars":{}} -->